tobiengel/contiki-ng/arch/platform/simplelink/cc13xx-cc26xx/sensortag/cc1352r/CC1352R_STK.c
/*
 *  =============================== ECDH ===============================
 */
#include <ti/drivers/ECDH.h>
#include <ti/drivers/ecdh/ECDHCC26X2.h>

ECDHCC26X2_Object ecdhCC26X2Objects[CC1352RSTK_ECDHCOUNT];

const ECDHCC26X2_HWAttrs ecdhCC26X2HWAttrs[CC1352RSTK_ECDHCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const ECDH_Config ECDH_config[CC1352RSTK_ECDHCOUNT] = {
    {
         .object  = &ecdhCC26X2Objects[CC1352RSTK_ECDH0],
         .hwAttrs = &ecdhCC26X2HWAttrs[CC1352RSTK_ECDH0]
    },
};

const uint_least8_t ECDH_count = CC1352RSTK_ECDHCOUNT;

/*
 *  =============================== ECJPAKE ===============================
 */
#include <ti/drivers/ECJPAKE.h>
#include <ti/drivers/ecjpake/ECJPAKECC26X2.h>

ECJPAKECC26X2_Object ecjpakeCC26X2Objects[CC1352RSTK_ECJPAKECOUNT];

const ECJPAKECC26X2_HWAttrs ecjpakeCC26X2HWAttrs[CC1352RSTK_ECJPAKECOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const ECJPAKE_Config ECJPAKE_config[CC1352RSTK_ECJPAKECOUNT] = {
    {
         .object  = &ecjpakeCC26X2Objects[CC1352RSTK_ECJPAKE0],
         .hwAttrs = &ecjpakeCC26X2HWAttrs[CC1352RSTK_ECJPAKE0]
    },
};

const uint_least8_t ECJPAKE_count = CC1352RSTK_ECJPAKECOUNT;


/*
 *  =============================== SHA2 ===============================
 */
#include <ti/drivers/SHA2.h>
#include <ti/drivers/sha2/SHA2CC26X2.h>

SHA2CC26X2_Object sha2CC26X2Objects[CC1352RSTK_SHA2COUNT];

const SHA2CC26X2_HWAttrs sha2CC26X2HWAttrs[CC1352RSTK_SHA2COUNT] = {
    {
        .intPriority       = ~0,
    }
};

const SHA2_Config SHA2_config[CC1352RSTK_SHA2COUNT] = {
    {
         .object  = &sha2CC26X2Objects[CC1352RSTK_SHA20],
         .hwAttrs = &sha2CC26X2HWAttrs[CC1352RSTK_SHA20]
    },
};

const uint_least8_t SHA2_count = CC1352RSTK_SHA2COUNT;
/*
 *  =============================== ECDSA ===============================
 */
#include <ti/drivers/ECDSA.h>
#include <ti/drivers/ecdsa/ECDSACC26X2.h>

ECDSACC26X2_Object ecdsaCC26X2Objects[CC1352RSTK_ECDSACOUNT];

const ECDSACC26X2_HWAttrs ecdsaCC26X2HWAttrs[CC1352RSTK_ECDSACOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const ECDSA_Config ECDSA_config[CC1352RSTK_ECDSACOUNT] = {
    {
         .object  = &ecdsaCC26X2Objects[CC1352RSTK_ECDSA0],
         .hwAttrs = &ecdsaCC26X2HWAttrs[CC1352RSTK_ECDSA0]
    },
};

const uint_least8_t ECDSA_count = CC1352RSTK_ECDSACOUNT;


/*
 *  =============================== Crypto ===============================
 */
/*
#include <ti/drivers/crypto/CryptoCC26XX.h>

CryptoCC26XX_Object cryptoCC26XXObjects[CC1352RSTK_CRYPTOCOUNT];

const CryptoCC26XX_HWAttrs cryptoCC26XXHWAttrs[CC1352RSTK_CRYPTOCOUNT] = {
    {
        .baseAddr       = CRYPTO_BASE,
        .powerMngrId    = PowerCC26XX_PERIPH_CRYPTO,
        .intNum         = INT_CRYPTO_RESULT_AVAIL_IRQ,
        .intPriority    = ~0,
    }
};

const CryptoCC26XX_Config CryptoCC26XX_config[CC1352RSTK_CRYPTOCOUNT] = {
    {
         .object  = &cryptoCC26XXObjects[CC1352RSTK_CRYPTO0],
         .hwAttrs = &cryptoCC26XXHWAttrs[CC1352RSTK_CRYPTO0]
    },
};
*/
/*
 *  =============================== AESCCM ===============================
 */
#include <ti/drivers/AESCCM.h>
#include <ti/drivers/aesccm/AESCCMCC26XX.h>

AESCCMCC26XX_Object aesccmCC26XXObjects[CC1352RSTK_AESCCMCOUNT];

const AESCCMCC26XX_HWAttrs aesccmCC26XXHWAttrs[CC1352RSTK_AESCCMCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESCCM_Config AESCCM_config[CC1352RSTK_AESCCMCOUNT] = {
    {
         .object  = &aesccmCC26XXObjects[CC1352RSTK_AESCCM0],
         .hwAttrs = &aesccmCC26XXHWAttrs[CC1352RSTK_AESCCM0]
    },
};

const uint_least8_t AESCCM_count = CC1352RSTK_AESCCMCOUNT;


/*
 *  =============================== AESGCM ===============================
 */
#include <ti/drivers/AESGCM.h>
#include <ti/drivers/aesgcm/AESGCMCC26XX.h>

AESGCMCC26XX_Object aesgcmCC26XXObjects[CC1352RSTK_AESGCMCOUNT];

const AESGCMCC26XX_HWAttrs aesgcmCC26XXHWAttrs[CC1352RSTK_AESGCMCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESGCM_Config AESGCM_config[CC1352RSTK_AESGCMCOUNT] = {
    {
         .object  = &aesgcmCC26XXObjects[CC1352RSTK_AESGCM0],
         .hwAttrs = &aesgcmCC26XXHWAttrs[CC1352RSTK_AESGCM0]
    },
};

const uint_least8_t AESGCM_count = CC1352RSTK_AESGCMCOUNT;

/*
 *  =============================== AESCBC ===============================
 */
#include <ti/drivers/AESCBC.h>
#include <ti/drivers/aescbc/AESCBCCC26XX.h>

AESCBCCC26XX_Object aescbcCC26XXObjects[CC1352RSTK_AESCBCCOUNT];

const AESCBCCC26XX_HWAttrs aescbcCC26XXHWAttrs[CC1352RSTK_AESCBCCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESCBC_Config AESCBC_config[CC1352RSTK_AESCBCCOUNT] = {
    {
         .object  = &aescbcCC26XXObjects[CC1352RSTK_AESCBC0],
         .hwAttrs = &aescbcCC26XXHWAttrs[CC1352RSTK_AESCBC0]
    },
};

const uint_least8_t AESCBC_count = CC1352RSTK_AESCBCCOUNT;

/*
 *  =============================== AESCTR ===============================
 */
#include <ti/drivers/AESCTR.h>
#include <ti/drivers/aesctr/AESCTRCC26XX.h>

AESCTRCC26XX_Object aesctrCC26XXObjects[CC1352RSTK_AESCTRCOUNT];

const AESCTRCC26XX_HWAttrs aesctrCC26XXHWAttrs[CC1352RSTK_AESCTRCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESCTR_Config AESCTR_config[CC1352RSTK_AESCTRCOUNT] = {
    {
         .object  = &aesctrCC26XXObjects[CC1352RSTK_AESCTR0],
         .hwAttrs = &aesctrCC26XXHWAttrs[CC1352RSTK_AESCTR0]
    },
};

const uint_least8_t AESCTR_count = CC1352RSTK_AESCTRCOUNT;

/*
 *  =============================== AESECB ===============================
 */
#include <ti/drivers/AESECB.h>
#include <ti/drivers/aesecb/AESECBCC26XX.h>

AESECBCC26XX_Object aesecbCC26XXObjects[CC1352RSTK_AESECBCOUNT];

const AESECBCC26XX_HWAttrs aesecbCC26XXHWAttrs[CC1352RSTK_AESECBCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESECB_Config AESECB_config[CC1352RSTK_AESECBCOUNT] = {
    {
         .object  = &aesecbCC26XXObjects[CC1352RSTK_AESECB0],
         .hwAttrs = &aesecbCC26XXHWAttrs[CC1352RSTK_AESECB0]
    },
};

const uint_least8_t AESECB_count = CC1352RSTK_AESECBCOUNT;

