tobiengel/contiki-ng/arch/platform/simplelink/cc13xx-cc26xx/sensortag/cc1352r/CC1352R_STK.c
/*
 *  =============================== AESCTRDRBG ===============================
 */
#include <ti/drivers/AESCTRDRBG.h>
#include <ti/drivers/aesctrdrbg/AESCTRDRBGXX.h>

AESCTRDRBGXX_Object aesctrdrbgXXObjects[CC1352RSTK_AESCTRDRBGCOUNT];

const AESCTRDRBGXX_HWAttrs aesctrdrbgXXHWAttrs[CC1352RSTK_AESCTRDRBGCOUNT] = {
    {
        .aesctrIndex       = CC1352RSTK_AESCTR0,
    }
};

const AESCTRDRBG_Config AESCTRDRBG_config[CC1352RSTK_AESCTRDRBGCOUNT] = {
    {
         .object  = &aesctrdrbgXXObjects[CC1352RSTK_AESCTRDRBG0],
         .hwAttrs = &aesctrdrbgXXHWAttrs[CC1352RSTK_AESCTRDRBG0]
    },
};

const uint_least8_t AESCTRDRBG_count = CC1352RSTK_AESCTRDRBGCOUNT;

/*
 *  =============================== TRNG ===============================
 */
#include <ti/drivers/TRNG.h>
#include <ti/drivers/trng/TRNGCC26XX.h>

TRNGCC26XX_Object trngCC26XXObjects[CC1352RSTK_TRNGCOUNT];

const TRNGCC26XX_HWAttrs trngCC26X2HWAttrs[CC1352RSTK_TRNGCOUNT] = {
    {
        .intPriority       = ~0,
        .swiPriority       = 0,
        .samplesPerCycle   = 240000,
    }
};

const TRNG_Config TRNG_config[CC1352RSTK_TRNGCOUNT] = {
    {
         .object  = &trngCC26XXObjects[CC1352RSTK_TRNG0],
         .hwAttrs = &trngCC26X2HWAttrs[CC1352RSTK_TRNG0]
    },
};

const uint_least8_t TRNG_count = CC1352RSTK_TRNGCOUNT;

/*
 *  =============================== GPIO ===============================
 */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOCC26XX.h>

/*
 * Array of Pin configurations
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC1352RSTK.h
 * NOTE: Pins not used for interrupts should be placed at the end of the
 *       array. Callback entries can be omitted from callbacks array to
 *       reduce memory usage.
 */
GPIO_PinConfig gpioPinConfigs[] = {

    /* Input pins */
    GPIOCC26XX_DIO_15 | GPIO_DO_NOT_CONFIG,  /* Button 0 */
    GPIOCC26XX_DIO_14 | GPIO_DO_NOT_CONFIG,  /* Button 1 */

    /* Output pins */
    GPIOCC26XX_DIO_21 | GPIO_DO_NOT_CONFIG,  /* LED */
    GPIOCC26XX_DIO_07 | GPIO_DO_NOT_CONFIG,  /* LED */
    GPIOCC26XX_DIO_06 | GPIO_DO_NOT_CONFIG,  /* LED */

    /* SPI Flash CSN */
    GPIOCC26XX_DIO_20 | GPIO_DO_NOT_CONFIG,

    /* CapTIvate Interrupts */
    GPIOCC26XX_DIO_22 | GPIO_DO_NOT_CONFIG,
    GPIOCC26XX_DIO_24 | GPIO_DO_NOT_CONFIG,
};





/*
 * Array of callback function pointers
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC1352RSTK.h
 * NOTE: Pins not used for interrupts can be omitted from callbacks array to
 *       reduce memory usage (if placed at end of gpioPinConfigs array).
 */
GPIO_CallbackFxn gpioCallbackFunctions[] = {
    NULL,  /*  Button 0 */
    NULL,  /*  Button 1 */
    NULL,  /*  LED 0 */
    NULL,  /*  LED 1 */
    NULL,  /*  LED 2 */
    NULL,   /* SPI */
    NULL,
    NULL


};

const GPIOCC26XX_Config GPIOCC26XX_config = {
    .pinConfigs         = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks          = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = CC1352RSTK_GPIOCOUNT,
    .numberOfCallbacks  = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority        = (~0)
};

/*
 *  =============================== GPTimer ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/timer/GPTimerCC26XX.h>

GPTimerCC26XX_Object gptimerCC26XXObjects[CC1352RSTK_GPTIMERCOUNT];

const GPTimerCC26XX_HWAttrs gptimerCC26xxHWAttrs[CC1352RSTK_GPTIMERPARTSCOUNT] = {
    { .baseAddr = GPT0_BASE, .intNum = INT_GPT0A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT0, .pinMux = GPT_PIN_0A, },
    { .baseAddr = GPT0_BASE, .intNum = INT_GPT0B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT0, .pinMux = GPT_PIN_0B, },
    { .baseAddr = GPT1_BASE, .intNum = INT_GPT1A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT1, .pinMux = GPT_PIN_1A, },
    { .baseAddr = GPT1_BASE, .intNum = INT_GPT1B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT1, .pinMux = GPT_PIN_1B, },
    { .baseAddr = GPT2_BASE, .intNum = INT_GPT2A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT2, .pinMux = GPT_PIN_2A, },
    { .baseAddr = GPT2_BASE, .intNum = INT_GPT2B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT2, .pinMux = GPT_PIN_2B, },
    { .baseAddr = GPT3_BASE, .intNum = INT_GPT3A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT3, .pinMux = GPT_PIN_3A, },
    { .baseAddr = GPT3_BASE, .intNum = INT_GPT3B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT3, .pinMux = GPT_PIN_3B, },
};

const GPTimerCC26XX_Config GPTimerCC26XX_config[CC1352RSTK_GPTIMERPARTSCOUNT] = {
    { &gptimerCC26XXObjects[CC1352RSTK_GPTIMER0], &gptimerCC26xxHWAttrs[CC1352RSTK_GPTIMER0A], GPT_A },
    { &gptimerCC26XXObjects[CC1352RSTK_GPTIMER0], &gptimerCC26xxHWAttrs[CC1352RSTK_GPTIMER0B], GPT_B },
    { &gptimerCC26XXObjects[CC1352RSTK_GPTIMER1], &gptimerCC26xxHWAttrs[CC1352RSTK_GPTIMER1A], GPT_A },
    { &gptimerCC26XXObjects[CC1352RSTK_GPTIMER1], &gptimerCC26xxHWAttrs[CC1352RSTK_GPTIMER1B], GPT_B },
    { &gptimerCC26XXObjects[CC1352RSTK_GPTIMER2], &gptimerCC26xxHWAttrs[CC1352RSTK_GPTIMER2A], GPT_A },
    { &gptimerCC26XXObjects[CC1352RSTK_GPTIMER2], &gptimerCC26xxHWAttrs[CC1352RSTK_GPTIMER2B], GPT_B },
    { &gptimerCC26XXObjects[CC1352RSTK_GPTIMER3], &gptimerCC26xxHWAttrs[CC1352RSTK_GPTIMER3A], GPT_A },
    { &gptimerCC26XXObjects[CC1352RSTK_GPTIMER3], &gptimerCC26xxHWAttrs[CC1352RSTK_GPTIMER3B], GPT_B },
};

/*
 *  =============================== I2C ===============================
*/
#include <ti/drivers/I2C.h>
#include <ti/drivers/i2c/I2CCC26XX.h>

#if TI_I2C_CONF_ENABLE

I2CCC26XX_Object i2cCC26xxObjects[CC1352RSTK_I2CCOUNT];

const I2CCC26XX_HWAttrsV1 i2cCC26xxHWAttrs[CC1352RSTK_I2CCOUNT] = {
#if TI_I2C_CONF_I2C0_ENABLE
    {
        .baseAddr    = I2C0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_I2C0,
        .intNum      = INT_I2C_IRQ,
        .intPriority = ~0,
        .swiPriority = 0,
        .sdaPin      = CC1352RSTK_I2C0_SDA0,
        .sclPin      = CC1352RSTK_I2C0_SCL0,
    },
#endif
};

