tobiengel/contiki-ng/arch/platform/simplelink/cc13xx-cc26xx/sensortag/cc1352r/CC1352R_STK.c
/*
*  =============================== Power ===============================
*/
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26X2.h>
#include "clock-arch.h"

const PowerCC26X2_Config PowerCC26X2_config = {
   .policyInitFxn      = NULL,
   .policyFxn          = &clock_arch_standby_policy,
   .calibrateFxn       = &PowerCC26XX_calibrate,
   .enablePolicy       = true,
   .calibrateRCOSC_LF  = true,
   .calibrateRCOSC_HF  = true,
};
/*
 *  =============================== PWM ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>

PWMTimerCC26XX_Object pwmtimerCC26xxObjects[CC1352RSTK_PWMCOUNT];

const PWMTimerCC26XX_HwAttrs pwmtimerCC26xxHWAttrs[CC1352RSTK_PWMCOUNT] = {
    { .pwmPin = CC1352RSTK_PWMPIN0, .gpTimerUnit = CC1352RSTK_GPTIMER0A },
    { .pwmPin = CC1352RSTK_PWMPIN1, .gpTimerUnit = CC1352RSTK_GPTIMER0B },
    { .pwmPin = CC1352RSTK_PWMPIN2, .gpTimerUnit = CC1352RSTK_GPTIMER1A },
    { .pwmPin = CC1352RSTK_PWMPIN3, .gpTimerUnit = CC1352RSTK_GPTIMER1B },
    { .pwmPin = CC1352RSTK_PWMPIN4, .gpTimerUnit = CC1352RSTK_GPTIMER2A },
    { .pwmPin = CC1352RSTK_PWMPIN5, .gpTimerUnit = CC1352RSTK_GPTIMER2B },
    { .pwmPin = CC1352RSTK_PWMPIN6, .gpTimerUnit = CC1352RSTK_GPTIMER3A },
    { .pwmPin = CC1352RSTK_PWMPIN7, .gpTimerUnit = CC1352RSTK_GPTIMER3B },
};

const PWM_Config PWM_config[CC1352RSTK_PWMCOUNT] = {
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352RSTK_PWM0], &pwmtimerCC26xxHWAttrs[CC1352RSTK_PWM0] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352RSTK_PWM1], &pwmtimerCC26xxHWAttrs[CC1352RSTK_PWM1] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352RSTK_PWM2], &pwmtimerCC26xxHWAttrs[CC1352RSTK_PWM2] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352RSTK_PWM3], &pwmtimerCC26xxHWAttrs[CC1352RSTK_PWM3] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352RSTK_PWM4], &pwmtimerCC26xxHWAttrs[CC1352RSTK_PWM4] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352RSTK_PWM5], &pwmtimerCC26xxHWAttrs[CC1352RSTK_PWM5] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352RSTK_PWM6], &pwmtimerCC26xxHWAttrs[CC1352RSTK_PWM6] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352RSTK_PWM7], &pwmtimerCC26xxHWAttrs[CC1352RSTK_PWM7] },
};

const uint_least8_t PWM_count = CC1352RSTK_PWMCOUNT;

/*
 *  =============================== RF Driver ===============================
 */
#include <ti/drivers/rf/RF.h>

const RFCC26XX_HWAttrsV2 RFCC26XX_hwAttrs = {
    .hwiPriority        = ~0,       /* Lowest HWI priority */
    .swiPriority        = 0,        /* Lowest SWI priority */
    .xoscHfAlwaysNeeded = true,     /* Keep XOSC dependency while in stanby */
    .globalCallback     = NULL,     /* No board specific callback */
    .globalEventMask    = 0         /* No events subscribed to */
};

/*
 *  =============================== SPI DMA ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPICC26XXDMA.h>

#if TI_SPI_CONF_ENABLE

SPICC26XXDMA_Object spiCC26XXDMAObjects[CC1352RSTK_SPICOUNT];

/*
 * NOTE: The SPI instances below can be used by the SD driver to communicate
 * with a SD card via SPI.  The 'defaultTxBufValue' fields below are set to 0xFF
 * to satisfy the SDSPI driver requirement.
 */
const SPICC26XXDMA_HWAttrsV1 spiCC26XXDMAHWAttrs[CC1352RSTK_SPICOUNT] = {
#if TI_SPI_CONF_SPI0_ENABLE
    {
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = CC1352RSTK_SPI0_MOSI,
        .misoPin            = CC1352RSTK_SPI0_MISO,
        .clkPin             = CC1352RSTK_SPI0_CLK,
        .csnPin             = CC1352RSTK_SPI0_CSN,
        .minDmaTransferSize = 10
    },
#endif
#if TI_SPI_CONF_SPI1_ENABLE
    {
        .baseAddr           = SSI1_BASE,
        .intNum             = INT_SSI1_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI1,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI1_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI1_TX,
        .mosiPin            = CC1352RSTK_SPI1_MOSI,
        .misoPin            = CC1352RSTK_SPI1_MISO,
        .clkPin             = CC1352RSTK_SPI1_CLK,
        .csnPin             = CC1352RSTK_SPI1_CSN,
        .minDmaTransferSize = 10
    },
#endif
};

const SPI_Config SPI_config[CC1352RSTK_SPICOUNT] = {
#if TI_SPI_CONF_SPI0_ENABLE
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC1352RSTK_SPI0],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC1352RSTK_SPI0]
    },
#endif
#if TI_SPI_CONF_SPI1_ENABLE
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC1352RSTK_SPI1],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC1352RSTK_SPI1]
    },
#endif
};

const uint_least8_t SPI_count = CC1352RSTK_SPICOUNT;

#endif /* TI_SPI_CONF_ENABLE */

/*
 *  =============================== UART ===============================
 */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTCC26XX.h>

#if TI_UART_CONF_ENABLE

UARTCC26XX_Object uartCC26XXObjects[CC1352RSTK_UARTCOUNT];

uint8_t uartCC26XXRingBuffer[CC1352RSTK_UARTCOUNT][32];

const UARTCC26XX_HWAttrsV2 uartCC26XXHWAttrs[CC1352RSTK_UARTCOUNT] = {
#if TI_UART_CONF_UART0_ENABLE
    {
        .baseAddr       = UART0_BASE,
        .powerMngrId    = PowerCC26XX_PERIPH_UART0,
        .intNum         = INT_UART0_COMB,
        .intPriority    = ~0,
        .swiPriority    = 0,
        .txPin          = CC1352RSTK_UART_TX,
        .rxPin          = CC1352RSTK_UART_RX,
        .ctsPin         = PIN_UNASSIGNED,
        .rtsPin         = PIN_UNASSIGNED,
        .ringBufPtr     = uartCC26XXRingBuffer[CC1352RSTK_UART0],
        .ringBufSize    = sizeof(uartCC26XXRingBuffer[CC1352RSTK_UART0]),
        .txIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_1_8,
        .rxIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_4_8,
        .errorFxn       = NULL
    },
#endif
};

