tobiengel/contiki-ng/arch/platform/simplelink/cc13xx-cc26xx/sensortag/cc1352r/CC1352R_STK.c
const UART_Config UART_config[CC1352RSTK_UARTCOUNT] = {
#if TI_UART_CONF_UART0_ENABLE
    {
        .fxnTablePtr = &UARTCC26XX_fxnTable,
        .object      = &uartCC26XXObjects[CC1352RSTK_UART0],
        .hwAttrs     = &uartCC26XXHWAttrs[CC1352RSTK_UART0]
    },
#endif
};

const uint_least8_t UART_count = CC1352RSTK_UARTCOUNT;

#endif /* TI_UART_CONF_ENABLE */

/*
 *  =============================== UDMA ===============================
 */
#include <ti/drivers/dma/UDMACC26XX.h>

UDMACC26XX_Object udmaObjects[CC1352RSTK_UDMACOUNT];

const UDMACC26XX_HWAttrs udmaHWAttrs[CC1352RSTK_UDMACOUNT] = {
    {
        .baseAddr    = UDMA0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_UDMA,
        .intNum      = INT_DMA_ERR,
        .intPriority = ~0
    }
};

const UDMACC26XX_Config UDMACC26XX_config[CC1352RSTK_UDMACOUNT] = {
    {
         .object  = &udmaObjects[CC1352RSTK_UDMA0],
         .hwAttrs = &udmaHWAttrs[CC1352RSTK_UDMA0]
    },
};

/*
 *  =============================== Watchdog ===============================
 */
#include <ti/drivers/Watchdog.h>
#include <ti/drivers/watchdog/WatchdogCC26XX.h>

WatchdogCC26XX_Object watchdogCC26XXObjects[CC1352RSTK_WATCHDOGCOUNT];

const WatchdogCC26XX_HWAttrs watchdogCC26XXHWAttrs[CC1352RSTK_WATCHDOGCOUNT] = {
    {
        .baseAddr    = WDT_BASE,
        .reloadValue = 1000 /* Reload value in milliseconds */
    },
};

const Watchdog_Config Watchdog_config[CC1352RSTK_WATCHDOGCOUNT] = {
    {
        .fxnTablePtr = &WatchdogCC26XX_fxnTable,
        .object      = &watchdogCC26XXObjects[CC1352RSTK_WATCHDOG0],
        .hwAttrs     = &watchdogCC26XXHWAttrs[CC1352RSTK_WATCHDOG0]
    },
};

const uint_least8_t Watchdog_count = CC1352RSTK_WATCHDOGCOUNT;

/*
 *  Board-specific initialization function to disable external flash.
 *  This function is defined in the file CC1352RSTK_fxns.c
 */
extern void Board_initHook(void);

/*
 *  ======== CC1352RSTK_initGeneral ========
 */
void CC1352RSTK_initGeneral(void)
{
    Power_init();

    if (PIN_init(BoardGpioInitTable) != PIN_SUCCESS) {
        /* Error with PIN_init */
        while (1);
    }

    /* Perform board-specific initialization */
    Board_initHook();
}

/*
 *  ======== Board_init ========
 */
void Board_init(void)
{
    CC1352RSTK_initGeneral();
}
